Thank you for opening the issue @nikhilpalem . I was unfortunately unable to reproduce the issue with both versions 1.47.0 and the latest. Below are my run details.

```
  # awscc_cleanrooms_configured_table.test will be created
  + resource "awscc_cleanrooms_configured_table" "test" {
      + allowed_columns             = [
          + "customer_id",
          + "order_amount",
          + "order_date",
        ]
      + analysis_method             = "DIRECT_QUERY"
      + analysis_rules              = [
          + {
              + policy = {
                  + v1 = {
                      + aggregation = {
                          + additional_analyses    = (known after apply)
                          + aggregate_columns      = [
                        .....
      + tags                        = (known after apply)
    }

  # awscc_cleanrooms_configured_table_association.test_lowercase will be created
  + resource "awscc_cleanrooms_configured_table_association" "test_lowercase" {
      + arn                                         = (known after apply)
      + configured_table_association_analysis_rules = [
          + {
              + policy = {
                  + v1 = {
                      + aggregation = {
                          + allowed_additional_analyses = (known after apply)
                          + allowed_result_receivers    = [
                              + "############",
                            ]
                        }
                      + custom      = (known after apply)
                      + list        = (known after apply)
                    }
                }
              + type   = "AGGREGATION"
            },
        ]
      + configured_table_association_identifier     = (known after apply)
      + configured_table_identifier                 = (known after apply)
      + description                                 = "Test association with lowercase policy key"
      + id                                          = (known after apply)
      + membership_identifier                       = "faaf7dff-6afb-4698-b523-01715dad65fb"
      + name                                        = "test-association-lowercase-policy"
      + role_arn                                    = (known after apply)
      + tags                                        = (known after apply)
    }

    .......

Plan: 5 to add, 0 to change, 0 to destroy.
awscc_iam_role.cleanrooms_role: Creating...
awscc_glue_database.test: Creating...
awscc_glue_database.test: Creation complete after 5s [id=test_database_issue_2397]
aws_glue_catalog_table.test: Creating...
aws_glue_catalog_table.test: Creation complete after 1s [id=############:test_database_issue_2397:test_table_issue_2397]
awscc_cleanrooms_configured_table.test: Creating...
awscc_iam_role.cleanrooms_role: Still creating... [10s elapsed]
awscc_cleanrooms_configured_table.test: Creation complete after 6s [id=7bf1776e-d68d-43b6-a6ba-adce2db9b8e8]
awscc_iam_role.cleanrooms_role: Creation complete after 18s [id=cleanrooms-test-role-issue-2397]
awscc_cleanrooms_configured_table_association.test_lowercase: Creating...
awscc_cleanrooms_configured_table_association.test_lowercase: Creation complete after 6s [id=7bf1776e-d68d-43b6-a6ba-adce2db9b8e8|faaf7dff-6afb-4698-b523-01715dad65fb]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

```

Is there anything else in your configuration that you can think of that might be driving this ?